#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

# Completion system setup
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# Keybindings
belak/zsh-utils path:editor

# History
belak/zsh-utils path:history

# Prompt
romkatv/powerlevel10k
tolkonepiu/catppuccin-powerlevel10k-themes

# Minimal environment for OMZ plugins
getantidote/use-omz

# Aliases and completions
djui/alias-tips kind:defer
ohmyzsh/ohmyzsh path:plugins/aliases
ohmyzsh/ohmyzsh path:plugins/brew kind:defer conditional:is-macos
ohmyzsh/ohmyzsh path:plugins/git kind:defer
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/tailscale

# Utilities
romkatv/zsh-bench kind:path
tolkonepiu/vscode-shell-integration-zsh-plugin
tolkonepiu/wakatime-zsh-plugin kind:defer conditional:has-wakatime
zshzoo/macos kind:defer conditional:is-macos

# Fish-like features
zdharma-continuum/fast-syntax-highlighting kind:defer  # Syntax highlighting
zsh-users/zsh-autosuggestions kind:defer               # Auto-suggestions
zsh-users/zsh-history-substring-search kind:defer      # Up/Down to search history
