#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

# Completions
mattmc3/ez-compinit branch:main pin:5c9b6da88a463573e26e6846ff164026640ef2f6
zsh-users/zsh-completions branch:master pin:03bae0bf3f9c4ab894f1f11a31ffe7a1e1029879 kind:fpath path:src

# Keybindings
belak/zsh-utils branch:main pin:be71275c50506bf2dbedfd21c0fb5adcc5847c92 path:editor

# Prompt
romkatv/powerlevel10k branch:master pin:9253fb1c5034410c43a0c681ff8294181c54016c
tolkonepiu/catppuccin-powerlevel10k-themes branch:main pin:6e72187953e5e9face7fbf8dcc926d691f7d1f2d

# Aliases
djui/alias-tips branch:master pin:41cb143ccc3b8cc444bf20257276cb43275f65c4 kind:defer
ohmyzsh/ohmyzsh branch:master pin:ff1df9a0399d56b9f6e957bb62a2d4ba6bc0ef4c path:plugins/aliases kind:defer
ohmyzsh/ohmyzsh branch:master pin:ff1df9a0399d56b9f6e957bb62a2d4ba6bc0ef4c path:plugins/brew kind:defer conditional:is-macos
ohmyzsh/ohmyzsh branch:master pin:ff1df9a0399d56b9f6e957bb62a2d4ba6bc0ef4c path:plugins/git kind:defer
ohmyzsh/ohmyzsh branch:master pin:ff1df9a0399d56b9f6e957bb62a2d4ba6bc0ef4c path:plugins/kubectl kind:defer

# Utilities
romkatv/zsh-bench branch:master pin:28b1b1bc888159f0a2cf50f9d29381758341aba1 kind:path
tolkonepiu/vscode-shell-integration-zsh-plugin branch:main pin:5929ec06fb9a41d8f06af38556308c1951aca6eb
tolkonepiu/wakatime-zsh-plugin branch:master pin:45d74478745f5faf8d1bafa83e6b76bcc6c1c29a kind:defer conditional:'is-callable wakatime-cli'
zshzoo/macos branch:main pin:440e565ef0f31c4aaa51f720dffc652601155eed kind:defer conditional:is-macos

# Syntax highlighting
zdharma-continuum/fast-syntax-highlighting branch:master pin:3d574ccf48804b10dca52625df13da5edae7f553 kind:defer

# Auto-suggestions
zsh-users/zsh-autosuggestions branch:master pin:85919cd1ffa7d2d5412f6d3fe437ebdbeeec4fc5 kind:defer

# Up/Down to search history
zsh-users/zsh-history-substring-search branch:master pin:14c8d2e0ffaee98f2df9850b19944f32546fdea5 kind:defer conditional:'! is-callable atuin'
